app/controllers/leaderboard_controller.rb

  def index
    @entries = Leaderboard.paginate(:page => params[:page,], :order => "votes desc")
---
SELECT * FROM "leaderboards" ORDER BY votes desc LIMIT 30 OFFSET 0
SELECT count(*) AS count_all FROM "leaderboards"

  def import_csv
    import_file = params[:dump][:file]
    Leaderboard.destroy_all

    FasterCSV.parse(import_file.read).each do |row|
      l = Leaderboard.new
      l.status = row[3]
      l.complete = row[4]
      l.votes = row[5]
      l.first_name = row[7]
      l.last_name = row[8]
      l.title = row[10]

      l.save
---
DELETE FROM "leaderboards" WHERE "id" = 1
SELECT * FROM "leaderboards"
INSERT INTO "leaderboards" ("votes", "created_at", "title", "updated_at", "complete", "last_name", "status", "first_name") VALUES(NULL, '2010-10-27 19:53:25.941654', NULL, '2010-10-27 19:53:25.941654', NULL, NULL, NULL, NULL) RETURNING "id"